In [2]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
    'sex': ['M', 'F', np.nan, 'M', 'F'],
    'score': [5, 4, 3, 4, np.nan],
})
df

   sex  score
0    M    5.0
1    F    4.0
2  NaN    3.0
3    M    4.0
4    F    NaN

In [8]:
# 결측치 확인하기
pd.isna(df)

     sex  score
0  False  False
1  False  False
2   True  False
3  False  False
4  False   True

In [11]:
pd.isna(df).sum()

sex      1
score    1
dtype: int64

In [13]:
# 결측치 있는 행 제거하기
df.dropna(subset = 'sex')

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0
4   F    NaN

In [14]:
# 여러 변수에 결측치 없는 데이터 추출하기
df.dropna(subset = ['sex', 'score'])

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [15]:
# 결측치가 하나라도 있으면 제거하기
df.dropna()

  sex  score
0   M    5.0
1   F    4.0
3   M    4.0

In [21]:
# 수치 연산 메서드는 자동으로 결측치를 제거하고 연산한다.
score_sum = df['score'].sum()
score_mean = df['score'].mean()

print('score_sum: ', score_sum)
print('score_mean: ', score_mean)

score_sum:  16.0
score_mean:  4.0

In [24]:
df_2 = df.groupby('sex').agg(
    score_sum = ('score', 'sum'),
    score_mean = ('score', 'mean')
)
df_2

     score_sum  score_mean
sex
F          4.0         4.0
M          9.0         4.5